In [87]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.cross_validation import train_test_split
from sklearn.svm import LinearSVC

In [17]:
dtypes = {
    "PassengerId" : "int64",
    "Survived": "int64",
    "Pclass" : "category",
    "Sex" : "category",
    "Age" : "float64",
    "SibSp" : "int64",
    "Parch" : "int64",
    "Fare" : "float64",
    "Cabin" : "category",
    "Embarked" : "category"
}

In [78]:
train_df = pd.read_csv('train.csv',sep=',',header=0,usecols=["PassengerId","Survived",
            "Pclass","Sex","Age","SibSp","Parch","Fare","Cabin","Embarked"],dtype=dtypes,na_values=[' '])

train_df.set_index("PassengerId",inplace=True)
train_df.dropna(subset=['Embarked'],inplace=True)
train_df.Age.fillna(X.Age.mean(),inplace=True)

train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 1 to 891
Data columns (total 9 columns):
Survived    889 non-null int64
Pclass      889 non-null category
Sex         889 non-null category
Age         889 non-null float64
SibSp       889 non-null int64
Parch       889 non-null int64
Fare        889 non-null float64
Cabin       202 non-null object
Embarked    889 non-null category
dtypes: category(3), float64(2), int64(3), object(1)
memory usage: 51.5+ KB

In [79]:
X = train_df[["Pclass","Sex","Age","SibSp","Parch","Fare","Embarked"]]
y = train_df[["Survived"]]

X.head(3)

            Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                3    male  22.0      1      0   7.2500        S
2                1  female  38.0      1      0  71.2833        C
3                3  female  26.0      0      0   7.9250        S

In [80]:
num_feat = X.select_dtypes('number').columns.values
cat_feat = X.select_dtypes('category').columns.values
X_num = X[num_feat]
X_cat = X[cat_feat]

In [81]:
X_num = (X_num - X_num.mean()) / X_num.std()
X_num = X_num.fillna(X_num.mean())
X_num.head()

                  Age     SibSp     Parch      Fare
PassengerId
1           -0.099094  0.431108 -0.474059 -0.499958
2            0.811932  0.431108 -0.474059  0.788503
3            0.128663 -0.474932 -0.474059 -0.486376
4            0.641115  0.431108 -0.474059  0.422623
5            0.641115 -0.474932 -0.474059 -0.483861

In [82]:
X_cat = pd.get_dummies(X_cat)
X_cat.head()

,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,
1,0,0,1,0,1,0,0,1
2,1,0,0,1,0,1,0,0
3,0,0,1,1,0,0,0,1
4,1,0,0,1,0,0,0,1
5,0,0,1,0,1,0,0,1

In [83]:
X = pd.concat([X_num,X_cat],axis=1)
X.head(3)

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,
1,-0.099094,0.431108,-0.474059,-0.499958,0,0,1,0,1,0,0,1
2,0.811932,0.431108,-0.474059,0.788503,1,0,0,1,0,1,0,0
3,0.128663,-0.474932,-0.474059,-0.486376,0,0,1,1,0,0,0,1

In [84]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=0)

In [85]:
model = LinearSVC().fit(X_train,y_train)

/home/matheusbarbosa/anaconda3/lib/python3.7/site-packages/sklearn/utils/validation.py:578: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [86]:
model.score(X_test,y_test)

0.7488789237668162